{
  "pageInfo": {
    "pageTitle": "Mike Clarke's Website",
    "technologiesTitle": "Technologies",
    "technologiesSubTitle": "Technology Interests",
    "technologiesIntro": " Over the years i've been lucky enough to have worked with and been involved with a vast array of technologies. I started my career as an electrical engineer but was interested in electronics and electrics from an early age. After a few years as an electrical apprentice working for Thames Water, I was lucky enough to be able to move into the ICA (Instrumentation, Control and Automation) department. The ICA dept. was a reasonably new dept. within Thames Water and its function was mainly related to upgrading and automating the process and control of the plant that the sites used. After passing my apprenticeship I eventually got the role of Systems Engineer where I was responsible for the South East area for clean water treatment. This involved working on real-time control systems for the reseviours, pumping stations and the London Water Ring Main. After 11 years I left Thames Water and moved more towards business application software development.",
    "interests": "Interests"
  },

  "about": [
    {
      "text": "I've been an engineer for 37 years now. I started as an Electrical and Electronics Engineer in 1987 as part of an apprenticeship with Thames Water. I was lucky enough to get into control and automation and from there became interested in real-time industrial programming."
    },
    {
      "text": "I worked mostly on GEC Gem 80 Programmable Logic Controllers (PLCs) but also on Mitsubishi and Allen Bradley PLCs. All of these controllers used ladder logic. Towards the end of the 90s, many systems were replaced or extended with Supervisory, Control and Data Acquisition (SCADA) systems. These systems allowed processes to be controlled using software more like we see today. Systems such as Bristol Babcock used Advanced Communications and Control Oriented Language (ACCOL) that ran on their distributed Network 3000 devices and were all connected to DEC 3000 workstations running VMS via RS-232, RS-242, RS-485 and later on 100BASE-T Ethernet connections."
    },
    {
      "text": "After some years of working on industrial control software I became interested in web programming. Web programming was in its infancy around this time (1996-97) but Microsoft had released Active Server Pages (ASP) that allowed developers to create dynamic websites using HTML and inline script. My first commercial project using ASP was whilst working for a Dotcom business that catered for students in 2001. This involved redeveloping their website from a static to a dynamic site that included messages boards, chat rooms and virtual tours of colleges and universities. I then spent many years as a full-stack developer using mainly Microsoft technologies, such as .Net, Asp.Net MVC, SQL Server and JavaScript before moving into team leading and management roles."
    }
  ],

  "personalInfo": {
    "name": "Mike Clarke",
    "title": "Software Engineer & Enginering Manager",
    "roles": [
      {
        "role": "Systems Engineer"
      },
      {
        "role": "Technical Manager"
      },
      {
        "role": "Analyst Programmer"
      },
      {
        "role": "Development Analyst"
      },
      {
        "role": "Senior Developer"
      },
      {
        "role": "Head of Technical Delivery"
      },
      {
        "role": "Software Developer"
      },
      {
        "role": "Engineering Principal"
      },
      {
        "role": "Head of Software Engineering"
      },
      {
        "role": "Engineering Manager"
      },
      {
        "role": "Head of Engineering"
      }
    ],
    "website": "www.mikeclarke.co.uk",
    "degree": "BSc Hons Computing Science",
    "city": "London, UK",
    "email": "mail@mikeclarke.co.uk",
    "phone": "07740 336 325",
    "twitter": "https://twitter.com/MikeClarke_1970",
    "linkedIn": "https://www.linkedin.com/in/mike-clarke-9935013/",
    "facebook": "https://www.facebook.com/mike.clarke.18488",
    "instagram": "https://www.instagram.com/sidcupmc/",
    "github": "https://github.com/sidcupmc",
    "passion": [
      {
        "text": "Engineering Manager with a software engineering background and experience of creating, scaling, motivating and leading high-performing teams. The ability to adapt to any situation and a good communicator at all levels, including C-suite. I possess product development, project management and stakeholder management skills. Am passionate about problem-solving and an advocate for Agile software development and DevOps practices."
      },
      {
        "text": "I strive for team accountability, shared ownership and team autonomy where teams have a good team morale, are able to collaborate well, are able to focus and can ultimately make the best decisions themselves."
      }
    ]
  },

  "education": [
    {
      "title": "CMI Level 5 Diploma in Management and Leadership",
      "year": "2020 - 2022",
      "establishment": "Chartered Management Institute",
      "modules": [
        {
          "module": "Principles of Management and Leadership in an organisational context"
        },
        {
          "module": "Principles of developing, managing and leading individuals and teams to achieve success"
        },
        {
          "module": "Managing stakeholder relationships"
        },
        {
          "module": "Managing projects to achieve results"
        },
        {
          "module": "Managing change"
        },
        {
          "module": "Creating and delivering operational plans"
        },
        {
          "module": "Managing finance"
        }
      ]
    },
    {
      "title": "BSc (Hons) Computing Science (2:1)",
      "year": "1994 - 1999",
      "establishment": "University of Greenwich",
      "modules": [
        {
          "module": "Object Oriented Software Design"
        },
        {
          "module": "Relational Database Design"
        },
        {
          "module": "Computer Systems Building"
        },
        {
          "module": "Data Communication and Networks"
        },
        {
          "module": "Human Computer Interaction"
        },
        {
          "module": "Maths"
        },
        {
          "module": "Business Skills for Computing Professionals"
        }
      ]
    },
    {
      "title": "BTEC ONC Electrical and Electronic Engineering",
      "year": "1991 - 1993",
      "establishment": "Bromley College of Technology",
      "modules": [
        {
          "module": "Electrical and Electronic Principles"
        },
        {
          "module": "Electronics"
        },
        {
          "module": "Microelectronic Systems"
        },
        {
          "module": "Software Design Methods"
        },
        {
          "module": "Digital Systems"
        },
        {
          "module": "Engineering Applications of Computers"
        },
        {
          "module": "Computer Systems Building"
        },
        {
          "module": "Analytical Maths"
        },
        {
          "module": "Industry and Society"
        }
      ]
    },
    {
      "title": "City & Guilds Electrical and Electronic Engineering Part I-III",
      "year": "1988 - 1991",
      "establishment": "Woolwich College",
      "modules": []
    },
    {
      "title": "Secondary School",
      "year": "1982 - 1987",
      "establishment": "Eltham Green School",
      "modules": [
        {
          "module": "O Level - Physics"
        },
        {
          "module": "O Level - English Literature"
        },
        {
          "module": "O Level - Art"
        },
        {
          "module": "CSE - English Language"
        },
        {
          "module": "CSE - Economics"
        },
        {
          "module": "CSE - Geography"
        }
      ]
    }
  ],

  "courses": [
    {
      "year": "2024",
      "title": "Microsoft Azure Fundamentals (AZ-900) Certified"
    },
    {
      "year": "2020",
      "title": "DevOps Institute DevOps Leader Accredited"
    },
    {
      "year": "2020",
      "title": "DevOps Institute DevOps Foundation Accredited"
    },
    {
      "year": "2017",
      "title": "Scrum.Org Professional Scrum Master PSM1"
    },
    {
      "year": "2017",
      "title": "Developing Microsoft Azure Solutions (M20532)"
    },
    {
      "year": "2017",
      "title": "Developing Cross-Platform Apps with C# using Xamarin"
    },
    {
      "year": "2014",
      "title": "ITIL Foundation Certificate in Service Management"
    },
    {
      "year": "2013",
      "title": "Agile Alliance Scrum Master Certified"
    },
    {
      "year": "2013",
      "title": "Agile Alliance Scrum Developer Certified"
    },
    {
      "year": "2012",
      "title": "Agile Software Development and TDD Training Course"
    },
    {
      "year": "2007",
      "title": "Certified Ektron CMS Developer"
    },
    {
      "year": "2005",
      "title": "MCP Developing & Implementing Web Apps with C# .NET"
    },
    {
      "year": "2002",
      "title": "Developing ASP.NET applications using Visual Studio .NET"
    },
    {
      "year": "2002",
      "title": "Windows 2000 Security (ISA, IIS5)"
    },
    {
      "year": "2001",
      "title": "Developing ASP applications using Microsoft Interdev 6.0"
    },
    {
      "year": "2000",
      "title": "MCP Microsoft NT Server 4"
    },
    {
      "year": "2000",
      "title": "MCP Microsoft NT Server 4 In the Enterprise"
    },
    {
      "year": "2000",
      "title": "MCP Microsoft Internet Information Server 4"
    },
    {
      "year": "1999",
      "title": "Microsoft NT Workstation 4"
    },
    {
      "year": "1998",
      "title": "MCP TCP/IP Internetworking with NT 4.0"
    },
    {
      "year": "1998",
      "title": "Global Knowledge, Mastering Visual Basic Fundamentals"
    },
    {
      "year": "1998",
      "title": "Microsoft Networking Essentials"
    }
  ],

  "work": [
    {
      "jobTitle": "Head of Engineering",
      "dates": "Jun 2024 - present",
      "company": "Royal Pharmaceutical Society",
      "duties": [
        {
          "duty": "Leading an engineering team of up to 20 members: Responsible for managing, providing leadership, hiring, training, and evaluating team members."
        },
        {
          "duty": "Developing and implementing engineering strategies: Working closely with senior management to develop and implement engineering strategies that align with the company's overall goals and objectives."
        },
        {
          "duty": "Managing project timelines and budgets: Responsible for ensuring that projects are completed on time and within budget by managing project timelines, resources, and budgets."
        },
        {
          "duty": "Collaborating with other departments: Working closely with other departments, such as product development and editorial, to ensure that engineering projects align with the company's overall strategy."
        },
        {
          "duty": "Ensuring compliance with industry standards: Responsible for ensuring that the engineering department operates in compliance with all relevant industry standards and regulations."
        },
        {
          "duty": "Communicating with stakeholders: Communicating regularly with stakeholders, such as senior management, customers, and partners, to keep them informed of project progress and to address any concerns or issues."
        }
      ]
    },
    {
      "jobTitle": "Engineering Manager",
      "dates": "Jun 2023 - Feb 2024",
      "company": "Checkatrade",
      "duties": [
        {
          "duty": "Managing a team of software engineers working on transforming the existing legacy .Net applications and moving them to a micro services-based architecture, hosted in GCP."
        },
        {
          "duty": "Helped improve the quality of the product backlog and speed up delivery by creating user stories, backlog grooming and introducing agile ceremonies to aid prioritisation and sizing."
        },
        {
          "duty": "Improved software delivery process by using CCV metrics to measure deployment frequency, lead time, cycle time and coding days.  Introduced better reporting metrics using Jira stats, presented in Confluence documentation. Improved visibility of information using automation tools e.g. GIT to Slack, incident information (Incident.IO) to Slack and Datadog to Slack."
        },
        {
          "duty": "Instilled a culture of ownership within the team enabling them to make collective decisions and to become more accountable, both individually and as a team."
        }
      ]
    },
    {
      "jobTitle": "Head of Software Engineering",
      "dates": "Apr 2022 - Oct 2022",
      "company": "RDT",
      "duties": [
        {
          "duty": "Headed up the Software Engineering function, consisting of around 35 Graduate, Associate, Senior, and Lead Software Engineers. Five direct reports and around 30 indirect reports. Responsible for the recruitment, training and career progression of all engineers."
        },
        {
          "duty": "Helped introduce better ways of working including setting up agile product teams and implementing modern working practices to help drive a culture of rapid feedback and continuous improvement."
        },
        {
          "duty": "Introduced a community of practice that helped contribute to better communication, better ways of working, and reduction of duplication and waste. This included setting up online communities and online lunch and learn sessions. Established a Software Engineering Team Charter that helped improve working practices and create consistency across the software engineering function."
        },
        {
          "duty": "Set up a skills matrix for all Engineers to facilitate skills tracking and help with identifying training requirements."
        }
      ]
    },
    {
      "jobTitle": "Engineering Principal",
      "dates": "Oct 2016 - Feb 2022",
      "company": "London & Quadrant",
      "duties": [
        {
          "duty": "Managing a team of 16 Software, DevOps, Test Engineers and Scrum Masters. Overseeing the team’s software development and testing processes, resource management, team training/development and mentoring. Helping the teams embed DevOps practices throughout the SDLC process."
        },
        {
          "duty": "Responsible for the output of five agile cross-functional squads, encouraging team members to write clean, maintainable code using SOLID principles and ensuring good test coverage. Helped implement DevOps practices such as CI/CD using Team City, Octopus Deploy and Azure DevOps and working practices such as TDD, BDD, Pair Programming and Peer Reviews."
        }
      ]
    },
    {
      "jobTitle": "Senior Developer",
      "dates": "Oct 2011 - Sep 2016",
      "company": "London & Quadrant",
      "duties": [
        {
          "duty": "Working on the first ever Agile software development project redesigning and developing a housing management system, including a new Rents and Service Charges Calculation system."
        },
        {
          "duty": "Worked within a Scrum team on the Business Transformation Project. This involved designing and developing software that facilitated new business processes for the organisation's home lettings and sales divisions"
        },
        {
          "duty": "I took the role of Scrum Master throughout the project's three-year timescale and helped ensure that Scrum ceremonies such as product refinement, sprint planning, sprint retrospectives and sprint reviews were carried out."
        }
      ]
    },
    {
      "jobTitle": "Senior Developer",
      "dates": "Dec 2009 - Oct 2011",
      "company": "Nomura",
      "duties": [
        {
          "duty": "Developing the trading application for the Equity Research department. This included desktop, server, windows services and web applications."
        },
        {
          "duty": "Bespoke applications such as an application for automating Excel and PowerPoint data updating, web services to provide data to client applications and creating .Net DLLs to add functionality to existing VB6 and .Net applications."
        },
        {
          "duty": "This role also involved database design and development including creating triggers and stored procedures. The role required a good knowledge of software architecture in order to develop systems that conform to the company software development policy of reusable and maintainable code."
        },
        {
          "duty": "The role also involved overseeing some of the Production Services support team's work, such as approving SQL code before it is released into the production environment."
        }
      ]
    },
    {
      "jobTitle": "Head of Technical Delivery",
      "dates": "Mar 2007 - Sep 2009",
      "company": "Condé Nast Publications Ltd",
      "duties": [
        {
          "duty": "Acting as a liaison between Systems department and Online department to ensure that company websites are built according to Condé Nast best practices."
        },
        {
          "duty": "This involved working with Online developers and third-party contractors to help improve the way software projects were run, cooperating with the infrastructure and MIS team to ensure that new software systems did not negatively impact Condé Nast's existing systems and infrastructure."
        },
        {
          "duty": "This role also involved development of the Johansens website owned by Condé Nast."
        }
      ]
    },
    {
      "jobTitle": "Senior Developer",
      "dates": "Oct 2005 - Mar 2007",
      "company": "Financial Training Company",
      "duties": [
        {
          "duty": "Modifying and improving FTC's e-commerce site."
        },
        {
          "duty": "Implementing change requests issued by project sponsors in accordance to Functional Design Specification and Technical Design Documents."
        },
        {
          "duty": "Modifying Business Objects to facilitate changes in Business requirements. Creating web services using C#. Creating .Net 2.0 applications using ADO.Net."
        }
      ]
    },
    {
      "jobTitle": "Development Analyst",
      "dates": "Sep 2004 - Oct 2005",
      "company": "Herbert Smith",
      "duties": [
        {
          "duty": "Modifying and developing existing web-based applications using C# and SQL 2000."
        },
        {
          "duty": "Creating windows applications using C# and VB.NET."
        },
        {
          "duty": "Modifying SharePoint Portal Server 2003 based Intranet, including creating web-parts using C#."
        }
      ]
    },
    {
      "jobTitle": "Analyst Programmer",
      "dates": "Jul 2002 - Sep 2004",
      "company": "CMS Cameron McKenna",
      "duties": [
        {
          "duty": "Designing, developing and Maintaining Intranet and Desktop applications using ASP.NET, C#, VB6, VB.NET, ASP, ADO.NET, ADO, XML, XSL, HTML, JavaScript, SQL 7, SQL 2000 and other Microsoft technologies."
        },
        {
          "duty": "Involved with software projects from initial feasibility stage, defining user requirements, right through to system testing and project completion."
        },
        {
          "duty": "Projects include creating an online records management system and an online financial reporting system. Creating .NET web services and COM components for use in legal Intranet portal and replacing legacy systems with new Microsoft based systems."
        }
      ]
    },
    {
      "jobTitle": "Technical Manager/Developer",
      "dates": "Feb 2001 - Jul 2002",
      "company": "StudentUK.com",
      "duties": [
        {
          "duty": "Developing Internet applications for StudentUK, (was one of the UK's leading student web-sites) using ASP.NET, VB6, ASP, ADO, HTML, JavaScript, SQL 7 and SQL 2000 and other Microsoft technologies. Creating simple graphics for website using Photoshop and Paint Shop Pro."
        },
        {
          "duty": "Responsible for all technical issues including network, firewall maintenance, server maintenance, backup strategy, virus protection and SQL databases."
        }
      ]
    },
    {
      "jobTitle": "Systems Engineer",
      "dates": "Aug 1997 - Feb 2001",
      "company": "Thames Water Utilities",
      "duties": [
        {
          "duty": "Developing Intranet applications using VB6, ASP, COM, ADO, HTML and JavaScript. Projects include design and implementation of Fault-reporting System and Web-based File Storage System."
        }
      ]
    },
    {
      "jobTitle": "ICA Technician/Team leader",
      "dates": "Jun 1991 - Apr 1997",
      "company": "Thames Water Utilities",
      "duties": [
        {
          "duty": "Installing, developing and maintaining PC and VAX based control and monitoring systems. Project management of capital works up to £25,000. Installation, calibration and maintenance of instrumentation and control systems."
        }
      ]
    },
    {
      "jobTitle": "Electrical and Instrumentation Apprentice",
      "dates": "Jul 1987 - Jun 1991",
      "company": "Thames Water Utilities",
      "duties": []
    }
  ],

  "testimonials": [
    {
      "picSource": "MikeFriel.jpg",
      "name": "Michael Friel FBCS",
      "title": "Engineering Director, B2C EMEA",
      "text": "I had the pleasure of working with Mike during a digital transformation programme at L&Q. Througout this period Mike acted as a strong, competent advocate for modern software engineering practices. He was a supportive manager for his team and highly focused in delivering the highest quality outcomes for the business. He was very supportive of me in my role, and a trusted member of my leadership team. Mike demonstrated a natural tendency towards best practice in engineering and delivery. He actively promoted the adoption of agile practices while driving a high quality agenda in software delivery outcomes. I would recommend Mike to any organisation seeking to hire a strong engineering manager. I would welcome the opportunity to work with him again in the future."
    },
    {
      "picSource": "JamieGardiner.jpg",
      "name": "Jamie Gardiner",
      "title": "Senior Software Engineer at Cazoo",
      "text": "I highly recommend Mike as a Software Engineering Manager. With strong technical knowledge in the Microsoft space, particularly in .NET and Azure, he consistently demonstrated an in-depth understanding of complex concepts, elevating our team's work. Mike stands up for his team, shielding them from distractions and fostering focus and productivity. He is an advocate of Agile software engineering practices, and actively promotes their implementation within the team and the wider business. He also welcomes suggestions, promotes healthy discussions, and encourages critical thinking. He identifies individual and team strengths and provides tailored guidance, helping engineers thrive professionally and technically."
    },
    {
      "picSource": "AndyDeakins.jpg",
      "name": "Andrew Deakins",
      "title": "Azure Developer at L&Q",
      "text": "It is my pleasure to highly recommend Michael Clarke for any role as an Engineering Principal. I have had the privilege of working closely with Michael at L&Q on a number of occasions, where he proved his exceptional leadership skills and dedication to driving improvement throughout the L&Q organisation. As a leader, Michael inspired his team members to excel through his own exemplary work ethic and collaborative approach and fostered an environment of open communication, where ideas are valued, and diverse perspectives are embraced. Due to Michael's background in and around I.T. development, he has a unique perspective and understanding of the subject matter which further improves this communication. Beyond his technical expertise and leadership capabilities, Michael exhibited exceptional professionalism and a strong commitment to upholding the highest standards of integrity and quality in his work. He is not only a valuable asset to any engineering project or initiative but also a trusted mentor and advisor who is always willing to lend a helping hand and share his knowledge and expertise with others. In summary, Michael is an outstanding Engineering Principal who brings a wealth of experience, skills, and passion to everything he does. He would undoubtedly make a significant and positive impact in any engineering leadership role. I wholeheartedly recommend him without reservation."
    },
    {
      "picSource": "ChikaChidi.jpg",
      "name": "Chika Chidi",
      "title": "Principal Software Engineer at Gentrack Ltd (Global)",
      "text": "I have had the pleasure of working closely with Mike for a number of years in his capacity as an Engineering Principal at L&Q, and I can confidently attest to his exceptional leadership and technical prowess. He was responsible for the output of several multifaceted high-performing Agile teams, successfully leading them through the delivery of numerous high-profile complex projects whilst always ensuring seamless collaboration and synergy across his teams. One of Mike's many key strengths was his attention to detail and meticulous approach to software development and testing, which ensured clarity and consistency in our processes as well as contributed to the overall success of our projects. Mike actively promoted the adoption of Agile, DevOps and Software Engineering best practices including clean code, continuous testing, CI/CD, and was instrumental in shaping our ways of working and improving overall quality of our delivery outputs, while reducing lead times. Furthermore, Mike was committed and dedicated to fostering a culture of collaboration and continuous learning. He led by example, encouraged open communication, promoted diversity and inclusion, approached challenges as opportunities, provided coaching/mentoring, and ensured each of his reports had the necessary skills and knowledge they required to excel in their roles. In summary, Mike is an invaluable asset to any organisation seeking a dynamic and strong Engineering Manager/Principal and I would recommend him for any leadership role within the engineering domain. I would also welcome the opportunity to work with him again in the future."
    }
  ],

  "technology": {
    "types": [
      {
        "type": "ICA",
        "filter": "ica"
      },
      {
        "type": "Internet",
        "filter": "internet"
      },
      {
        "type": "Agile & Dev Ops",
        "filter": "agile"
      },
      {
        "type": "Tools",
        "filter": "tools"
      }
    ],
    "technologies": [
      {
        "picSource": "420ma-loop.png",
        "filter": "ica",
        "name": "loop",
        "title": "4-20 mA Loop",
        "link": "/technologydetail?tech=loop",
        "infoLink": "https://en.wikipedia.org/wiki/Current_loop",
        "intro": "In electrical signalling an analog current loop is used where a device must be monitored or controlled remotely over a pair of conductors. Only one current level can be present at any time. A major application of current loops is the industry de facto standard 4–20 mA current loop for process control applications, where they are extensively used to carry signals from process instrumentation to proportional–integral–derivative (PID) controllers, supervisory control and data acquisition (SCADA) systems, and programmable logic controllers (PLCs). <br/> <br/> They are also used to transmit controller outputs to the modulating field devices such as control valves. These loops have the advantages of simplicity and noise immunity, and have a large international user and equipment supplier base. Some 4–20 mA field devices can be powered by the current loop itself, removing the need for separate power supplies, and the smart Highway Addressable Remote Transducer (HART) Protocol uses the loop for communications between field devices and controllers. Various automation protocols may replace analog current loops, but 4–20 mA is still a principal industrial standard."
      },
      {
        "picSource": "ohms-law.png",
        "filter": "ica",
        "name": "ohms",
        "title": "Ohms Law",
        "link": "/technologydetail?tech=ohms",
        "infoLink": "https://en.wikipedia.org/wiki/Ohm%27s_law",
        "intro": "Ohm's law states that the electric current through a conductor between two points is directly proportional to the voltage across the two points. Introducing the constant of proportionality, the resistance, one arrives at the three mathematical equations used to describe this relationship: <b>V=IR or I=V/R or R = V/I</b><br/><br/>where I is the current through the conductor, V is the voltage measured across the conductor and R is the resistance of the conductor. More specifically, Ohm's law states that the R in this relation is constant, independent of the current. If the resistance is not constant, the previous equation cannot be called Ohm's law, but it can still be used as a definition of static/DC resistance. Ohm's law is an empirical relation which accurately describes the conductivity of the vast majority of electrically conductive materials over many orders of magnitude of current. However some materials do not obey Ohm's law; these are called non-ohmic. The law was named after the German physicist Georg Ohm, who, in a treatise published in 1827, described measurements of applied voltage and current through simple electrical circuits containing various lengths of wire. Ohm explained his experimental results by a slightly more complex equation than the modern form above."
      },
      {
        "picSource": "SCADA-System.png",
        "filter": "ica",
        "name": "scada",
        "title": "SCADA",
        "link": "/technologydetail?tech=scada",
        "infoLink": "https://en.wikipedia.org/wiki/SCADA",
        "intro": "SCADA (supervisory control and data acquisition) is a control system architecture comprising computers, networked data communications and graphical user interfaces for high-level supervision of machines and processes. It also covers sensors and other devices, such as programmable logic controllers, which interface with process plant or machinery. The operator interfaces which enable monitoring and the issuing of process commands, such as controller setpoint changes, are handled through the SCADA computer system. The subordinated operations, e.g. the real-time control logic or controller calculations, are performed by networked modules connected to the field sensors and actuators.<br/><br/>The SCADA concept was developed to be a universal means of remote-access to a variety of local control modules, which could be from different manufacturers and allowing access through standard automation protocols. In practice, large SCADA systems have grown to become similar to distributed control systems in function, while using multiple means of interfacing with the plant. They can control large-scale processes that can span multiple sites, and work over large distances. It is one of the most commonly-used types of industrial control systems, in spite of concerns about SCADA systems being vulnerable to cyberwarfare/cyberterrorism attacks."
      },
      {
        "picSource": "PLC.png",
        "filter": "ica",
        "name": "plc",
        "title": "PLCs",
        "link": "/technologydetail?tech=plc",
        "infoLink": "https://en.wikipedia.org/wiki/Programmable_logic_controller",
        "intro": "A programmable logic controller (PLC) or programmable controller is an industrial computer that has been ruggedized and adapted for the control of manufacturing processes, such as assembly lines, machines, robotic devices, or any activity that requires high reliability, ease of programming, and process fault diagnosis.PLCs can range from small modular devices with tens of inputs and outputs (I/O), in a housing integral with the processor, to large rack-mounted modular devices with thousands of I/O, and which are often networked to other PLC and SCADA systems. They can be designed for many arrangements of digital and analog I/O, extended temperature ranges, immunity to electrical noise, and resistance to vibration and impact.<br/><br/>PLCs were first developed in the automobile manufacturing industry to provide flexible, rugged and easily programmable controllers to replace hard-wired relay logic systems. Dick Morley, who invented the first PLC, the Modicon 084, for General Motors in 1968, is considered the father of PLC. A PLC is an example of a hard real-time system since output results must be produced in response to input conditions within a limited time, otherwise unintended operation may result. Programs to control machine operation are typically stored in battery-backed-up or non-volatile memory."
      },
      {
        "picSource": "venturi5.png",
        "filter": "ica",
        "name": "venturi",
        "title": "Venturis",
        "link": "/technologydetail?tech=venturi",
        "infoLink": "https://en.wikipedia.org/wiki/Venturi_effect",
        "intro": "The Venturi effect is the reduction in fluid pressure that results when a moving fluid speeds up as it flows through a constricted section (or choke) of a pipe. The Venturi effect is named after its discoverer, the 18th-century Italian physicist Giovanni Battista Venturi. The effect has various engineering applications, as the reduction in pressure inside the constriction can be used both for measuring the fluid flow and for moving other fluids (e.g. in a vacuum ejector). Venturi tubes are often used in processes where permanent pressure loss is not tolerable and where maximum accuracy is needed in case of highly viscous liquids."
      },
      {
        "picSource": "milltronics-multirangers-plus.png",
        "filter": "ica",
        "name": "ultrasonic",
        "title": "Ultrasonic Level Detection",
        "link": "/technologydetail?tech=ultrasonic",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "bb3330.png",
        "filter": "ica",
        "name": "bb",
        "title": "Bristol Babcock",
        "link": "/technologydetail?tech=bb",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "eurotherm-chessel.png",
        "filter": "ica",
        "name": "eurotherm",
        "title": "Temperature Monitoring",
        "link": "/technologydetail?tech=eurotherm",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "magflow.png",
        "filter": "ica",
        "name": "magflow",
        "title": "Magflows",
        "link": "/technologydetail?tech=magflow",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "microvax.png",
        "filter": "ica",
        "name": "microvax",
        "title": "DEC Microvax",
        "link": "/technologydetail?tech=microvax",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "parallel-serial-coms.png",
        "filter": "ica",
        "name": "comms",
        "title": "Parallel and Seriel Comms",
        "link": "/technologydetail?tech=comms",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "ladder-logic.png",
        "filter": "ica",
        "name": "ladder",
        "title": "Ladder Logic",
        "link": "/technologydetail?tech=ladder",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "pid.png",
        "filter": "ica",
        "name": "pid",
        "title": "PID controllers",
        "link": "/technologydetail?tech=pid",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "compuserve.png",
        "filter": "internet",
        "name": "compuserve",
        "title": "Compuserve",
        "link": "/technologydetail?tech=compuserve",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "agile.png",
        "filter": "agile",
        "name": "agile",
        "title": "Agile",
        "link": "/technologydetail?tech=agile",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "devops-cloud.png",
        "filter": "agile",
        "name": "devopscloud",
        "title": "DevOps Cloud",
        "link": "/technologydetail?tech=devopscloud",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "devops-loop.png",
        "filter": "agile",
        "name": "devopsloop",
        "title": "DevOps Loops",
        "link": "/technologydetail?tech=devopsloop",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "scrum-alliance.png",
        "filter": "agile",
        "name": "scrumalliance",
        "title": "Scrum Alliance",
        "link": "/technologydetail?tech=scrumalliance",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "scrum-org.png",
        "filter": "agile",
        "name": "scrumorg",
        "title": "Scrum.Org",
        "link": "/technologydetail?tech=scrumorg",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "devops-institute.png",
        "filter": "agile",
        "name": "devopsinst",
        "title": "Devops Institute",
        "link": "/technologydetail?tech=devopsinst",
        "infoLink": "",
        "intro": ""
      },

      {
        "picSource": "vb6.png",
        "filter": "tools",
        "name": "vb6",
        "title": "VB6",
        "link": "/technologydetail?tech=vb6",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "asp.png",
        "filter": "tools",
        "name": "asp",
        "title": "Active Server Pages",
        "link": "/technologydetail?tech=asp",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "dotnet.png",
        "filter": "tools",
        "name": "dotnet",
        "title": ".Net",
        "link": "/technologydetail?tech=dotnet",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "node.png",
        "filter": "tools",
        "name": "node",
        "title": "Node.JS",
        "link": "/technologydetail?tech=node",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "jquery.png",
        "filter": "tools",
        "name": "jquery",
        "title": "jQuery",
        "link": "/technologydetail?tech=jquery",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "mvc.png",
        "filter": "tools",
        "name": "mvc",
        "title": "MVC",
        "link": "/technologydetail?tech=mvc",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "teamcity.png",
        "filter": "tools",
        "name": "teamcity",
        "title": "Team City",
        "link": "/technologydetail?tech=teamcity",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "azure.png",
        "filter": "agile",
        "name": "azure",
        "title": "Azure",
        "link": "/technologydetail?tech=azure",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "git.png",
        "filter": "tools",
        "name": "git",
        "title": "GIT",
        "link": "/technologydetail?tech=git",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "nunit.png",
        "filter": "tools",
        "name": "nunit",
        "title": "NUnit",
        "link": "/technologydetail?tech=nunit",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "vs.png",
        "filter": "tools",
        "name": "vs",
        "title": "Visual Studio",
        "link": "/technologydetail?tech=vs",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "cucumber.png",
        "filter": "tools",
        "name": "cucumber",
        "title": "Cucumber",
        "link": "/technologydetail?tech=cucumber",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "bootstrap.png",
        "filter": "tools",
        "name": "bootstrap",
        "title": "Bootstrap",
        "link": "/technologydetail?tech=bootstrap",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "github.png",
        "filter": "tools",
        "name": "github",
        "title": "GitHub",
        "link": "/technologydetail?tech=github",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "azure-devops.png",
        "filter": "agile",
        "name": "azuredevops",
        "title": "Azure DevOps",
        "link": "/technologydetail?tech=azuredevops",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "octopus.png",
        "filter": "tools",
        "name": "octopus",
        "title": "Octopus",
        "link": "/technologydetail?tech=octopus",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "csharp.png",
        "filter": "tools",
        "name": "csharp",
        "title": "C#",
        "link": "/technologydetail?tech=csharp",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "selenium.png",
        "filter": "tools",
        "name": "selenium",
        "title": "Selenium",
        "link": "/technologydetail?tech=selenium",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "jira.png",
        "filter": "tools",
        "name": "jira",
        "title": "Jira",
        "link": "/technologydetail?tech=jira",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "specflow.png",
        "filter": "tools",
        "name": "specflow",
        "title": "Specflow",
        "link": "/technologydetail?tech=specflow",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "incidentio.png",
        "filter": "tools",
        "name": "incidentio",
        "title": "Incident.IO",
        "link": "/technologydetail?tech=incidentio",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "slack.png",
        "filter": "tools",
        "name": "slack",
        "title": "Slack",
        "link": "/technologydetail?tech=slack",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "confluence.png",
        "filter": "tools",
        "name": "confluence",
        "title": "Confluence",
        "link": "/technologydetail?tech=confluence",
        "infoLink": "",
        "intro": ""
      },
      {
        "picSource": "ccv.png",
        "filter": "tools",
        "name": "ccv",
        "title": "CCV",
        "link": "/technologydetail?tech=ccv",
        "infoLink": "",
        "intro": ""
      }
    ]
  }
}
